# TUGAS
# Pengenalan Dasar Library Pandas

Kelompok 4
1. Ircham Machbubi Sholih
2. Achmad Bimo Mulyo
3. Andhika Rivai
4. Ahmad Raffi Alhadipuro
5. Muhammad Rizky Baidlowi

In [4]:
import pandas as pd

In [7]:
# Membuat array satu dimensi "df"
df = pd.Series([1, 3, 4, 5])

# Membuat dataframe
data = {
    'Nama': ['Andi', 'Budi', 'Dodo', 'Ema', 'Kari'],
    'Nilai': [80, 20, 90, 40, 55],
    'Kelas': ['3B', '3A', '3B', '3B', '3A']
}
df = pd.DataFrame(data)

# Print seluruh baris pada kolom "Nama"
print(df['Nama'])

# Sortir data berdasarkan "Nilai" tertinggi ke terendah
df_sorted = df.sort_values(by='Nilai', ascending=False)
print(df_sorted)

0    Andi
1    Budi
2    Dodo
3     Ema
4    Kari
Name: Nama, dtype: object
   Nama  Nilai Kelas
2  Dodo     90    3B
0  Andi     80    3B
4  Kari     55    3A
3   Ema     40    3B
1  Budi     20    3A

# Bermain dengan Real Data
1. Download data dari link berikut: https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries/

2. Save ds_salaries.csv pada Google Drive

In [11]:
import pandas as pd

# Memuat data dari file CSV ke dalam dataframe "df"
df = pd.read_csv('ds_salaries.csv')

In [12]:
# Mencetak 5 baris teratas
print(df.head(5))

# Mencetak 5 baris terakhir
print(df.tail(5))

   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT

                    job_title  salary salary_currency  salary_in_usd  \
0              Data Scientist   70000             EUR          79833
1  Machine Learning Scientist  260000             USD         260000
2           Big Data Engineer   85000             GBP         109024
3        Product Data Analyst   20000             USD          20000
4   Machine Learning Engineer  150000             USD         150000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L
     Unnamed: 0  work_year experience_level employment_type      job_title  \
602         602       2022               SE              FT  Data Engineer
603         603       2022               SE              FT  Data Engineer
604         604       2022               SE              FT   Data Analyst
605         605       2022               SE              FT   Data Analyst
606         606       2022               MI              FT   AI Scientist

     salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
602  154000             USD         154000                 US           100
603  126000             USD         126000                 US           100
604  129000             USD         129000                 US             0
605  150000             USD         150000                 US           100
606  200000             USD         200000                 IN           100

    company_location company_size
602               US            M
603               US            M
604               US            M
605               US            M
606               US            L

In [13]:
# Mencetak nama-nama kolom
print(df.columns)

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [14]:
# Tampilkan data baris ke-5 hingga ke-10 pada kolom job_title
print(df.loc[4:9, 'job_title'])

# Tampilkan data baris ke-5 hingga ke-10 pada kolom company_location
print(df.loc[4:9, 'company_location'])

4    Machine Learning Engineer
5                 Data Analyst
6          Lead Data Scientist
7               Data Scientist
8        Business Data Analyst
9           Lead Data Engineer
Name: job_title, dtype: object
4    US
5    US
6    US
7    HU
8    US
9    NZ
Name: company_location, dtype: object

In [15]:
# Hitung rata-rata salary_in_usd
rata_rata_salary = df['salary_in_usd'].mean()
print("Rata-rata Salary (USD):", rata_rata_salary)

Rata-rata Salary (USD): 112297.86985172982

In [18]:
# Simpan data baris ke-5 hingga ke-20 ke dalam file CSV "sparse.csv"
df_subset = df.iloc[4:20]  # Memilih baris ke-5 hingga ke-20
df_subset.to_csv('sparse.csv', index=False)  # Menyimpan ke dalam file CSV tanpa indeks